/*
   https://x.com/RiddleSolverX/status/1907763269302989139
   """
   Can you find the Next Value?

   4 -> 7 -> 13 -> 25 -> ?
   """


   AllGood:
   [program = A + A - 1,res = 49,count = 87]
   [program = A - (1 - A),res = 49,count = 57]
   [program = A + A - A / A,res = 49.0,count = 56]
   [program = A + 6 + (A - 7),res = 49,count = 55]
   [program = A + A - 2 / 2,res = 49.0,count = 32]
   [program = 2 * A - 1,res = 49,count = 20]
   [program = A - 1 + A,res = 49,count = 18]
   [program = 2 * A - 2 / 2,res = 49.0,count = 4]

   resultMap = [49 = 5,49.0 = 3]

   Maple:
> IdentifySequence([4,7,13,25],'x');
Error, (in IdentifySequence) unable to identify sequence

> guessgf([4,7,13,25],x);
                        FAIL

   Mathematica:

In[22]:= FindSequenceFunction[{4,7,13,25},x] // Simplify
                -1 + x
Out[22]= 1 + 3 2
In[23]:= Table[%, {x,1,10}]
Out[23]= {4, 7, 13, 25, 49, 97, 193, 385, 769, 1537}


In[11]:= FindFormula[{4,7,13,25},x]
                          2.        3.
Out[11]= 1. + 4. x - 1.5 x   + 0.5 x
In[12]:= Table[%, {x,1,10}]
Out[12]= {4., 7., 13., 25., 46., 79., 127., 193., 280., 391.}

In[18]:= FindFormula[{4,7,13,25,49},x]
                              2         3          4
Out[18]= 4. - 2.25 x + 2.875 x  - 0.75 x  + 0.125 x
In[19]:= Table[%, {x,1,10}]                                                                               Out[19]= {4., 7., 13., 25., 49., 94., 172., 298., 490., 769.}
 
*/
data(math_riddles,Data,Vars,Unknown,Ops,Constants,MaxSize,Params) :-
  Seq = [4,7,13,25],
  % make_point_seq(Seq,Data,Unknown,Vars),
  make_seq(Seq,1,Data,Unknown,Vars),  
  Ops = [+,-,*,/],
  Constants = 1..10, %  ++ [random(-10,10) : _ in 1..10],
  MaxSize = 1,
  Params = new_map([init_size=1000, num_gens=100]).


